Repository: phpmyadmin/sql-parser
Catalog: locale/*/LC_MESSAGES/sqlparser.po
Languages: sq

source: Not implemented yet.
sq: Nuk është implementuar ende.

source: A new statement was found, but no delimiter between it and the previous one.
sq: Një deklaratë e re është gjetur, por nuk ka delimiter ndërmjet asaj dhe tjetrës më përpara.

source: Unrecognized alter operation.
sq: Veprim alter i panjohur.

source: %1$d values were expected, but found %2$d.
sq: Vlerat %1$d u pranuan, por gjeti %2$d.

source: An opening bracket followed by a set of values was expected.
sq: Pritet një kllapë e hapur, e ndjekur nga një set vlerash.

source: An opening bracket was expected.
sq: Pritet një kllapë e hapur.

source: A comma or a closing bracket was expected.
sq: Pritet një presje ose një kllapë mbyllëse.

source: A closing bracket was expected.
sq: Pritet një kllapë e mbylljes.

source: Unrecognized data type.
sq: Tip të dhënash i panjohur.

source: An alias was expected.
sq: Pritet një alias (pseudonim).

source: An alias was previously found.
sq: Një pseudonim është gjetur më përpara.

source: Unexpected dot.
sq: Pikë (dot) e papritur.

source: An expression was expected.
sq: Pritet një shprehje.

source: An offset was expected.
sq: Pritet një rezultat (offset).

source: This option conflicts with "%1$s".
sq: Ky opsion konflikton me "%1$s".

source: The old name of the table was expected.
sq: Pritet emri i vjetër i tabelës.

source: Keyword "TO" was expected.
sq: Pritet fjala kyçe "TO" (për).

source: The new name of the table was expected.
sq: Pritet emri i ri i tabelës.

source: A rename operation was expected.
sq: Pritet një veprim riemërimi.

source: Unexpected character.
sq: Karakter i papritur.

source: Expected whitespace(s) before delimiter.
sq: Pritet hapësirë(a) e bardhë para delimitrit.

source: Expected delimiter.
sq: Pritet delimiter.

source: Ending quote %1$s was expected.
sq: Pritet thonjëza e fundit %1$s.

source: Variable name was expected.
sq: Pritet emri i variablit.

source: Unexpected beginning of statement.
sq: Fillim i papritur i deklaratës.

source: Unrecognized statement type.
sq: Tip deklarate i panjohur.

source: No transaction was previously started.
sq: Nuk ka filluar ndonjë transaksion më parë.

source: Unexpected token.
sq: Shenjë e papritur.

source: This type of clause was previously parsed.
sq: Ky tip i klauzolës është parsuar më parë.

source: Unrecognized keyword.
sq: Fjalë kyçe e panjohur.

source: The name of the entity was expected.
sq: Pritet emri i entitetit.

source: At least one column definition was expected.
sq: Pritet së paku një përcaktim kolone.

source: A "RETURNS" keyword was expected.
sq: Pritet një fjalë kyçe "RETURNS".
